# AssetPropertyFloatArray Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyFloatArray Class
Members See Also
---
Represents a property consisting of an array of float values.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class AssetPropertyFloatArray : AssetProperty
```

Visual Basic
---
```text
Public Class AssetPropertyFloatArray _
	Inherits AssetProperty
```

Visual C++
---
```text
public ref class AssetPropertyFloatArray : public AssetProperty
```

# Remarks
In virtually all cases, the array will contain exactly 3 values.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..AssetProperty Autodesk.Revit.DB.Visual..::..AssetPropertyFloatArray
# See Also
AssetPropertyFloatArray Members
Autodesk.Revit.DB.Visual Namespace